Tutorial 2 - Darcy Forchheimer Porous fvModel Using ImopesFoam in OpenFOAM/Case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    Inlet
    {
        type            patch;
        nFaces          20;
        startFace       7780;
    }
    Outlet
    {
        type            patch;
        nFaces          20;
        startFace       7800;
    }
    Wall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          200;
        startFace       7820;
    }
    symmetry
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          200;
        startFace       8020;
    }
    Frontback
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          8000;
        startFace       8220;
    }
)

// ************************************************************************* //
